resultado_k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /mnt/k6/test_rendimiento.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.8s), 04/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 04/50 VUs  00.8s/30.0s

running (0m01.8s), 09/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 09/50 VUs  01.8s/30.0s

running (0m02.8s), 14/50 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 14/50 VUs  02.8s/30.0s

running (0m03.8s), 19/50 VUs, 2 complete and 0 interrupted iterations
default   [  13% ] 19/50 VUs  03.8s/30.0s

running (0m04.8s), 24/50 VUs, 2 complete and 0 interrupted iterations
default   [  16% ] 24/50 VUs  04.8s/30.0s

running (0m05.8s), 29/50 VUs, 2 complete and 0 interrupted iterations
default   [  19% ] 29/50 VUs  05.8s/30.0s

running (0m06.8s), 34/50 VUs, 3 complete and 0 interrupted iterations
default   [  23% ] 34/50 VUs  06.8s/30.0s

running (0m07.8s), 39/50 VUs, 4 complete and 0 interrupted iterations
default   [  26% ] 39/50 VUs  07.8s/30.0s

running (0m08.8s), 44/50 VUs, 6 complete and 0 interrupted iterations
default   [  29% ] 44/50 VUs  08.8s/30.0s

running (0m09.8s), 48/50 VUs, 8 complete and 0 interrupted iterations
default   [  33% ] 48/50 VUs  09.8s/30.0s

running (0m10.8s), 50/50 VUs, 11 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  10.8s/30.0s

running (0m11.8s), 50/50 VUs, 11 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  11.8s/30.0s

running (0m12.8s), 50/50 VUs, 12 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  12.8s/30.0s

running (0m13.8s), 50/50 VUs, 15 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  13.8s/30.0s

running (0m14.8s), 50/50 VUs, 18 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  14.8s/30.0s

running (0m15.8s), 50/50 VUs, 24 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  15.8s/30.0s

running (0m16.8s), 50/50 VUs, 28 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  16.8s/30.0s

running (0m17.8s), 50/50 VUs, 32 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  17.8s/30.0s

running (0m18.8s), 50/50 VUs, 35 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  18.8s/30.0s

running (0m19.8s), 50/50 VUs, 39 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  19.8s/30.0s

running (0m20.8s), 50/50 VUs, 42 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  20.8s/30.0s

running (0m21.8s), 50/50 VUs, 46 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  21.8s/30.0s

running (0m22.8s), 50/50 VUs, 48 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  22.8s/30.0s

running (0m23.8s), 50/50 VUs, 51 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  23.8s/30.0s

running (0m24.8s), 50/50 VUs, 54 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  24.8s/30.0s

running (0m25.8s), 50/50 VUs, 55 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  25.8s/30.0s

running (0m26.8s), 48/50 VUs, 58 complete and 0 interrupted iterations
default   [  89% ] 48/50 VUs  26.8s/30.0s

running (0m27.8s), 47/50 VUs, 61 complete and 0 interrupted iterations
default   [  93% ] 47/50 VUs  27.8s/30.0s

running (0m28.8s), 45/50 VUs, 65 complete and 0 interrupted iterations
default   [  96% ] 45/50 VUs  28.8s/30.0s

running (0m29.8s), 41/50 VUs, 69 complete and 0 interrupted iterations
default   [  99% ] 41/50 VUs  29.8s/30.0s

running (0m30.8s), 35/50 VUs, 75 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m31.8s), 31/50 VUs, 79 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m32.8s), 27/50 VUs, 83 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m33.8s), 21/50 VUs, 89 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m34.8s), 17/50 VUs, 93 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m35.8s), 11/50 VUs, 99 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m36.8s), 09/50 VUs, 101 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m37.8s), 07/50 VUs, 103 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m38.8s), 02/50 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m39.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m40.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m41.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m42.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m43.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m44.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s

running (0m45.8s), 01/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 39/50 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1500' p(95)=11.76s

    http_req_failed
    ✗ 'rate<0.01' rate=1.36%


  █ TOTAL RESULTS 

    checks_total.......: 330    7.083353/s
    checks_succeeded...: 99.09% 327 out of 330
    checks_failed......: 0.90%  3 out of 330

    ✗ Inicio - status es 200
      ↳  97% — ✓ 107 / ✗ 3
    ✓ Tienda - status es 200
    ✓ Tienda - contiene Catálogo

    HTTP
    http_req_duration..............: avg=5.4s   min=54.61ms med=4.34s  max=34.99s p(90)=9.76s  p(95)=11.76s
      { expected_response:true }...: avg=5.21s  min=54.61ms med=4.27s  max=34.99s p(90)=9.55s  p(95)=11.25s
    http_req_failed................: 1.36% 3 out of 220
    http_reqs......................: 220   4.722235/s

    EXECUTION
    iteration_duration.............: avg=12.84s min=2.89s   med=10.96s max=37.3s  p(90)=19.78s p(95)=24.81s
    iterations.....................: 110   2.361118/s
    vus............................: 1     min=1        max=50
    vus_max........................: 50    min=50       max=50

    NETWORK
    data_received..................: 31 MB 671 kB/s
    data_sent......................: 31 kB 658 B/s



running (0m46.6s), 00/50 VUs, 110 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  30s